Revit 2026 API

# IPerformanceAdviserRuleGetName Method

---

Retrieves the name of the rule.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
string GetName()
```
```vb
Function GetName As String
```
```cpp
String^ GetName()
```
```fsharp
abstract GetName : unit -> string
```

#### Return Value

String The name of the rule.

Method should return a short string naming the rule, typically as a one word in TitleCase. String should be localized.

#### Reference

IPerformanceAdviserRule Interface

Autodesk.Revit.DB Namespace